In [3]:
import numpy as np 
import pandas as pd

df=pd.DataFrame(np.random.randn(7,3))

In [23]:
df.iloc[:4,1]=0

In [26]:
df.fillna(method='ffill')

          0         1         2
0 -0.493723  0.000000 -0.156216
1       NAN  0.000000       NAN
2   2.22186  0.000000  -1.67047
3  0.762093  0.000000  0.499045
4   0.42432 -0.342631  0.562022
5 -0.802843 -0.238613   0.73149
6 -0.183039  1.073849  0.615541

In [82]:
np.random.seed(12345)
a=pd.Series(np.random.randint(1,50,5))
name=['ahsan','furqan','kashif','sadiq','furqan']
df=pd.DataFrame({'name':name,'age':a})
def status(a):
    if a>18:
        return 'u'
    else:
        return 'o'

In [84]:

df['status']=df['age'].map(status)
df

     name  age status
0   ahsan   35      u
1  furqan   38      u
2  kashif   30      u
3   sadiq    2      o
4  furqan   37      u

In [76]:
p=np.random.randint(33,80,5)
def per(p):
    if p>80:
        return 'A+'
    elif p<80 and p>70:
        return 'A'
    elif p<=69 and p>=60:
        return 'B'
    else:
        return 'F'

In [85]:
df=pd.DataFrame({'name':name,'marks':p})
df['per']=df['marks'].map(per)
df

     name  marks per
0   ahsan     74   A
1  furqan     70   F
2  kashif     67   B
3   sadiq     62   B
4  furqan     34   F

In [8]:
import urllib
import pandas as pd
import requests
from pandas.io.json import json_normalize

Crypto_URL=requests.get("https://min-api.cryptocompare.com/data/histohour?fsym=BTC&tsym=USD&limit=10&e=Kraken").json()